In [237]:
import pandas as pd

In [238]:
import numpy as np

In [239]:
import sklearn as skl

In [240]:
import matplotlib as plt

In [241]:
df= pd.read_csv('supershops.csv')

In [242]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()

In [243]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [244]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [245]:
df.dropna(inplace=True)

In [246]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# MinMaxScaler\Normalization

In [247]:
from sklearn.preprocessing import MinMaxScaler

In [248]:
m = MinMaxScaler()

In [249]:
df['Marketing Spend'] = m.fit_transform(df[['Marketing Spend']])

In [250]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [251]:
df['Administration_Transform'] = m.transform(df[['Administration']])

C:\Users\Ariyan Khan Monir\anaconda3\lib\site-packages\sklearn\base.py:493: FutureWarning: The feature names should match those that were passed during fit. Starting version 1.2, an error will be raised.
Feature names unseen at fit time:
- Administration
Feature names seen at fit time, yet now missing:
- Marketing Spend

  warnings.warn(message, FutureWarning)

In [252]:
df['Administration'].head()

0    136897.80
1    151377.59
2    101145.55
3    118671.85
4     91391.77
Name: Administration, dtype: float64

In [253]:
df.head()

,Marketing Spend,Administration,Transport,Area,Profit,Administration_Transform
0,0.692617,136897.80,471784.10,Dhaka,192261.83,0.827931
1,0.983359,151377.59,443898.53,Ctg,191792.06,0.915502
2,0.927985,101145.55,407934.54,Rangpur,191050.39,0.611709
3,0.873136,118671.85,383199.62,Dhaka,182901.99,0.717704
4,0.859438,91391.77,366168.42,Rangpur,166187.94,0.552720

# Standarization

In [254]:
from sklearn.preprocessing import StandardScaler

In [255]:
s = StandardScaler()

In [256]:
df1['Marketing Spend']=s.fit_transform(df1[['Marketing Spend']])

In [257]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [258]:
df1['Administration_Transform']= s.transform(df1[['Administration']])

C:\Users\Ariyan Khan Monir\anaconda3\lib\site-packages\sklearn\base.py:493: FutureWarning: The feature names should match those that were passed during fit. Starting version 1.2, an error will be raised.
Feature names unseen at fit time:
- Administration
Feature names seen at fit time, yet now missing:
- Marketing Spend

  warnings.warn(message, FutureWarning)

In [259]:
df1['Administration'].head()

0    136897.80
1    151377.59
2    101145.55
3    118671.85
4     91391.77
Name: Administration, dtype: float64

In [260]:
df1.head()

,Marketing Spend,Administration,Transport,Area,Profit,Administration_Transform
0,0.897913,136897.80,471784.10,Dhaka,192261.83,1.390293
1,1.955860,151377.59,443898.53,Ctg,191792.06,1.708944
2,1.754364,101145.55,407934.54,Rangpur,191050.39,0.603508
3,1.554784,118671.85,383199.62,Dhaka,182901.99,0.989202
4,1.504937,91391.77,366168.42,Rangpur,166187.94,0.388860

# Max Abs Scaler

In [261]:
from sklearn.preprocessing import MaxAbsScaler

In [262]:
mas = MaxAbsScaler()

In [263]:
df2['Marketing Spend']=mas.fit_transform(df2[['Marketing Spend']])

In [264]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [265]:
df2['Transport_Transform'] = mas.transform(df2[['Transport']])

C:\Users\Ariyan Khan Monir\anaconda3\lib\site-packages\sklearn\base.py:493: FutureWarning: The feature names should match those that were passed during fit. Starting version 1.2, an error will be raised.
Feature names unseen at fit time:
- Transport
Feature names seen at fit time, yet now missing:
- Marketing Spend

  warnings.warn(message, FutureWarning)

In [266]:
df2.head()

,Marketing Spend,Administration,Transport,Area,Profit,Transport_Transform
0,0.692617,136897.80,471784.10,Dhaka,192261.83,2.853259
1,0.983359,151377.59,443898.53,Ctg,191792.06,2.684613
2,0.927985,101145.55,407934.54,Rangpur,191050.39,2.467109
3,0.873136,118671.85,383199.62,Dhaka,182901.99,2.317517
4,0.859438,91391.77,366168.42,Rangpur,166187.94,2.214516

# Robust Scaler

In [267]:
from sklearn.preprocessing import RobustScaler

In [268]:
r = RobustScaler()

In [269]:
df3['Marketing Spend'] = r.fit_transform(df3[['Marketing Spend']])

In [270]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530       136897.80  471784.10    Dhaka  192261.83
1         1.452113       151377.59  443898.53      Ctg  191792.06
2         1.303634       101145.55  407934.54  Rangpur  191050.39
3         1.156567       118671.85  383199.62    Dhaka  182901.99
4         1.119836        91391.77  366168.42  Rangpur  166187.94

In [271]:
df3['Administration_Transform'] = r.fit_transform(df3[['Administration']])

In [272]:
df3.head()

,Marketing Spend,Administration,Transport,Area,Profit,Administration_Transform
0,0.672530,136897.80,471784.10,Dhaka,192261.83,0.345355
1,1.452113,151377.59,443898.53,Ctg,191792.06,0.697565
2,1.303634,101145.55,407934.54,Rangpur,191050.39,-0.524290
3,1.156567,118671.85,383199.62,Dhaka,182901.99,-0.097977
4,1.119836,91391.77,366168.42,Rangpur,166187.94,-0.761543

# MAX

In [273]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [274]:
max_val=df4['Marketing Spend'].max()

In [275]:
max_val

165349.2

In [276]:
df4['Marketing Spend'] =df4['Marketing Spend']/ max_val

In [277]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

# Quartile & the Interquartile Range

In [278]:
import numpy as np

In [279]:
dataset=[8,5,3,7,9,23,22,12,20,31,16,13,19,25,24]

In [280]:
Q1 = np.percentile(dataset,25)

In [281]:
Q1

8.5

In [282]:
Q2 = np.percentile(dataset,50)

In [283]:
Q2

16.0

In [284]:
Q3 = np.percentile(dataset,75)

In [285]:
Q3

22.5

In [286]:
IQR = Q3- Q2

In [287]:
IQR

6.5